app/Controllers/Admin/AdminController.php

SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
 LIMIT 6
---
            'akun' => $this->akun,
            'title' => 'Dashboard',
            'active' => $this->active,
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->get()->getNumRows(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->get()->getNumRows(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(6),