app/Controllers/Kas/KasController.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT COUNT(*) AS `numrows`
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
 LIMIT 6
---
            'akun' => $this->akun,
            'title' => 'Pemasukan Kas',
            'active' => 'kas',
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->countAllResults(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->countAllResults(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(6),

SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
 LIMIT 6
---
    public function viewPemasukan()
    {
        $data = [
            'akun' => $this->akun,
            'title' => 'All Post',
            'active' => 'kas', // ← ini yang ditambahkan
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->get()->getNumRows(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->get()->getNumRows(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(6),