app/Views/layout/footer.php

                use App\Models\CategoryModel;

                $categoryModel = new CategoryModel();
                $categories = $categoryModel->findAll();
---
SELECT *
FROM `tbl_category`