app/Views/layout/header.php

                    use App\Models\CategoryModel;

                    $categoryModel = new CategoryModel();
                    $categories = $categoryModel->findAll();
---
SELECT *
FROM `tbl_category`