app/Controllers/BaseController.php

SELECT *
FROM `tbl_user`
WHERE `user_id` = '5'
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        // Session
        $this->session = \Config\Services::session();

        // Cek Visitor
        $visitorModel = new VisitorModel();
        $user_ip = $_SERVER['REMOTE_ADDR'];
        $agent = $this->request->getUserAgent();
        if ($agent->isBrowser()) {
            $agent = $agent->getBrowser() . ' ' . $agent->getVersion();
        } elseif ($agent->isRobot()) {
            $agent = $agent->getRobot();
        } elseif ($agent->isMobile()) {
            $agent = $agent->getMobile();
        } else {
            $agent = 'Unidentified User Agent';
        }
        $visitorModel->count_visitor($user_ip, $agent);

        // Akun login
        if (session('role')) {
            $this->akunModel = new UserModel();
            $this->akun = $this->akunModel->where('user_id', session('id'))->first();